{"id":233,"date":"2024-04-05T12:19:54","date_gmt":"2024-04-05T12:19:54","guid":{"rendered":"https:\/\/seszp.com\/2024\/04\/05\/applications-examples-security-future-of-ads\/"},"modified":"2024-05-06T21:40:30","modified_gmt":"2024-05-06T21:40:30","slug":"applications-examples-security-future-of-ads","status":"publish","type":"post","link":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/","title":{"rendered":"Applications, Examples, Security &#038; Future of Ads"},"content":{"rendered":"<p><\/p>\n<div>\n<p>Gone are the days when only computers, phones, and tablets connected to the internet.<strong> <\/strong>By 2025, EMARKETER forecasts that the average time spent with internet of things (IoT) devices like smart speakers and connected cars will reach 45 minutes per day. But for connected TVs (CTV), perhaps the connected devices that are becoming most ubiquitous today, we forecast the average time spent with these will reach nearly 2 hours and 30 minutes per day by 2025. <\/p>\n<p>As of March 2023, there are an estimated 41.8 billion active IoT-connected devices worldwide, such as appliances and vehicles, thermostats, TVs, watches, refrigerators, and more, according to Frost &amp; Sullivan. As high-speed 5G connectivity expands to more regions, usage of IoT devices will increase. By 2026, the number of IoT mobile connections worldwide will more than double compared with 2021, according to July 2022 Berg Insight data.<\/p>\n<ul class=\"wp-block-iicustom-ii-article-summary summary-list\">\n<li><strong>Want to learn more about IoT and other technology trends?  <a rel=\"nofollow noopener\" target=\"_blank\" href=\"https:\/\/on.emarketer.com\/eDailyDirectSignup.html?utm_source=audience_dev&amp;utm_medium=site_insights_&amp;utm_campaign=eDaily0623&amp;_gl=1*9uco2q*_ga*MTA2Mzk2MDA1Ny4xNjY2MDMzNzEy*_ga_XXYLHB9SXG*MTcwOTgyNjMzOS40OTEuMS4xNzA5ODI4NTQ3LjYwLjAuMA..*_gcl_au*MTg5MDk5NzE0NS4xNzA4OTY2NzU2&amp;_ga=2.220662744.1362964390.1709578197-1063960057.1666033712#_gl=1*1o2itlt*_gcl_au*MTg5MDk5NzE0NS4xNzA4OTY2NzU2\">Sign up for the EMARKETER Daily newsletter.<\/a><\/strong><\/li>\n<\/ul>\n<div class=\"wp-block-image em-insights-image\">\n<figure class=\"aligncenter size-full\"><figcaption><em>A chart showing the IoT mobile connections worldwide, 2021 and 2026.<\/em><\/figcaption><\/figure>\n<\/div>\n<p>This guide clarifies how IoT works, highlighting real-world applications, key details on specific devices and examples, and some insight into how IoT will evolve for advertisers in the future.<\/p>\n<p>An IoT application is described as a collection of services and software that integrates the real-time data received from IoT devices. An IoT application then uses either machine learning or AI technology to analyze the real-time data received in order to make informed decisions. <\/p>\n<p>Here is a rundown of some of the more common IoT applications:<\/p>\n<p>1. <strong>CTVs:<\/strong> Unlike traditional or linear TV that is distributed through cable, satellite, or broadcast networks, CTVs connect to the internet directly or through an external device, like a streaming stick or set-top box. CTV can feature <a rel=\"nofollow noopener\" target=\"_blank\" href=\"https:\/\/www.emarketer.com\/insights\/ott-video-streaming-services\/\">OTT video and streaming video content that bypasses linear TV distribution.<\/p>\n<p>2. <strong>Connected cars:<\/strong> These vehicles are equipped with internet access and can share that access with others, just like connecting to a wireless network in a home or office. Connected cars offer in-car voice assistants and “infotainment” systems where drivers can access apps like maps, call, or text, and use media players like Spotify. Increasingly, connected cars are integrating commerce by enabling payment options for things like fuel, parking, and everyday purchases.<\/p>\n<p>3. <strong>Smart home devices:<\/strong> The smart home is a popular IoT category because of its accessibility and affordable price point. From the Amazon Echo to the Nest Thermostat, there are hundreds of products that users can control with their smartphone via an app or voice via voice assistant technology.<\/p>\n<p>4. <strong>Wearables:<\/strong> No longer for just telling time, Apple Watch and other smartwatches on the market have turned our wrists into smartphone holsters by enabling text messaging, phone calls, and more. Healthcare wearables, like Google-owned Fitbit, have helped revolutionize the fitness world by giving users more data about their physical health, including heart rate, calories burned, and tracking their exercise goals.<\/p>\n<p>5. <strong>Smart cities:<\/strong> IoT has the potential to transform entire cities by solving real problems citizens face each day through improving efficiencies and citizens’ quality of life. With the proper connections and data—enabled by sensors placed throughout a city—IoT can solve for stressors such as traffic congestion, with automated traffic lights that adjust to rush-hour patterns. IoT can also be used to make a city safer. Automated communication apps let residents report crimes, emergencies, or other issues like power outages to city or utility workers.   <\/p>\n<p>Now that we have a good idea of the range of applications for IoT devices, here is some detail on specific types of IoT devices.<\/p>\n<p>1. <strong>Smart TVs, Roku, and other streaming devices:<\/strong> In 2024, 233.9 million people in the US will watch video content via CTV, and that number will continue to grow, according to EMARKETER’s September 2023 forecast. By 2027, over 70% of the population will be CTV viewers. <\/p>\n<p>US viewers tend to watch CTV content either on a smart TV (67.1%), including Amazon’s Fire TV (47.6%), set-top boxes like Roku (55.2%), or on connected gaming consoles (36.6%). <\/p>\n<p>Amazon has become a major CTV provider with devices like its Fire TV Stick, a plug-in for TVs, a built-in Fire TV operating system, and the branded Amazon Fire TV set. <\/p>\n<p>Fire TV has become a leader in CTV advertising, and in the future, its voice assistant integration may lead to more shoppable CTV ad opportunities. Currently, users can sync their <a rel=\"nofollow noopener\" target=\"_blank\" href=\"https:\/\/www.amazon.com\/gp\/help\/customer\/display.html?nodeId=202104940#:~:text=You%20can%20link%20a%20compatible,app%20to%20link%20your%20devices\">Alexa-enabled device<\/a> to their Fire TV to use voice control for tasks like content searches, volume control, navigating apps, and so on. <\/p>\n<p>Similarly, Roku viewers can purchase products from Shopify merchants via shoppable CTV ads. Viewers can use their remotes to access product information, make a purchase, and resume streaming once the transaction is complete. <\/p>\n<p>2. <strong>Apple CarPlay, Android Auto, and more:<\/strong> In-car assistant systems are a gateway to fully integrating drivers’ smartphone ecosystems by offering an entire platform of customizable apps and services consumers are used to. <\/p>\n<p>We expect 157.3 million people will drive connected cars in 2024, per our August 2023 forecast. Of those, nearly 50 million drivers will use Apple CarPlay and 32.6 million drivers will use Android Auto. While Apple CarPlay and Android Auto hold a significant amount of market share, electric vehicle automakers—like Tesla, Rivian, and GM—are opting instead to use their own in-car solutions. <\/p>\n<p>As drivers increase, so will in-car commerce and payment opportunities. In July 2023, Visa partnered with Car IQ Inc. to encourage in-vehicle merchant payments for commercial cars. Drivers can use the Visa-integrated Car IQ Pay to pay for things like fuel, tolls, parking, and more without a physical card. The connected car payments industry is estimated to reach $600 billion by 2030, per <a rel=\"nofollow noopener\" target=\"_blank\" href=\"https:\/\/www.gocariq.com\/car-iq-teams-up-with-visa-to-drive-the-future-of-vehicle-payments\/\">Ptolemus<\/a> data cited by Car IQ Inc. <\/p>\n<p>Beyond fuel payments and parking, ordering food and other products is one of the most compelling use cases for such systems. For example, customers with the Domino’s iOS app installed on their iPhone can use their connected cars’ interface to “Tap to Order” a saved order or “Call to Order” with the hands-free system. <\/p>\n<p>3. <strong>Amazon Echo, Google Nest:<\/strong> AI voice assistants like the Amazon Echo and Google Nest (formerly Google Home) speakers are some of the most popular connected devices.<\/p>\n<p>An estimated 149.1 million US users will talk to voice assistants in 2024 for help with a variety of tasks, such as playing music, checking the weather, getting sports scores, ordering an Uber, and more. However, it’s important to note that only 10% of smart home users make purchases through their devices, according to an October 2022 EMARKETER survey conducted by Bizrate Insights.  <\/p>\n<p>By brand, the Amazon Echo leads in market share. We forecast that nearly 69 million US users will use an Amazon Echo in 2024, according to EMARKETER’s August 2023 forecast. In comparison, US Google Nest users will top 35.3 million  <\/p>\n<p>Despite its popularity, Amazon smart home hardware has not been very profitable for Amazon: The company has reportedly taken a $10 billion loss from Alexa devices and smart speakers. <\/p>\n<p>However, in September 2023, Amazon said it would integrate generative AI into its Alexa devices, which could give it momentum as generative AI sweeps through industries.<\/p>\n<p>In fact, advancements in AI will further the abilities of all IoT devices, perhaps leading many to become <a rel=\"nofollow noopener\" target=\"_blank\" href=\"https:\/\/www.techtarget.com\/iotagenda\/definition\/Artificial-Intelligence-of-Things-AIoT\">artificial intelligence of things<\/a> devices. <\/p>\n<p>4. <strong>Fitbit, Apple Watch:<\/strong> Over two-thirds of smart wearable users wear a smartwatch, yet user growth is slowing. In 2024, the number of smartwatch users will grow to 61.2 million, a tepid 3.8% growth rate, according to EMARKETER’s October 2022 forecast. <\/p>\n<p>Smartwatch growth is outpacing healthcare wearables, which track your steps, floors climbed, calories burned, and more. The device syncs to a smartphone or computer and creates understandable charts to monitor users progress based on their fitness data. <\/p>\n<p>Healthcare wearables like Fitbit still attract new users but have seen growth plateau post-pandemic. Amazon announced it would shut down its Halo line of healthcare wearables in April 2023. <\/p>\n<p>In terms of general smartwatch use, Apple remains the most dominant wearable. In 2024, over 33 million people, or 12.5% of the US population, will wear an Apple Watch, per our November 2023 forecast.<\/p>\n<p>5. <strong>Amazon Sidewalk Network:<\/strong> <a rel=\"nofollow noopener\" target=\"_blank\" href=\"https:\/\/www.digi.com\/blog\/post\/smart-cities-in-the-world\">Smart cities<\/a> are those that implement several IoT initiatives to help with traffic management, security, emergency response, sustainability, and more (e.g., Oslo, Norway; Barcelona, Spain; and Singapore).  <\/p>\n<p>Amazon’s Sidewalk network—a Wi-Fi network using Amazon Echo and Ring devices—could bridge the gap between the smart home and the smart city by providing long-range, low bandwidth to IoT devices. Now accessible to <a rel=\"nofollow noopener\" target=\"_blank\" href=\"https:\/\/www.aboutamazon.com\/news\/devices\/everything-you-need-to-know-about-amazon-sidewalk#:~:text=so%20much%20more.-,Amazon%20Sidewalk%20is%20a%20secure%2C%20free%2Dto%2Dconnect%20community,90%25%20of%20the%20U.S.%20population.\">90% of Americans<\/a>, per Amazon, the Sidewalk network can help residential users maintain connectivity for their devices, even as they move around.<\/p>\n<p>“This is a way to expand those networks and expand the area where it’s easily accessible to have connectivity,” said Yory Wurmser, our principal analyst, on an episode of the “Behind the Numbers: The Daily” podcast.<\/p>\n<h2><strong>IoT issues with privacy, security, and regulation<\/strong><\/h2>\n<p>With these new opportunities, advertisers should be aware of IoT and connected devices’ rolling data privacy regulations.<\/p>\n<p>In July 2023, the White House and the Federal Communications Commission introduced the US Cyber Trust Mark program, “which will place a label on [IoT] devices that meet the US government’s cyber standards for [IoT] products” as early as 2024, per Axios. To receive a stamp of approval, Axios reports that IoT devices will need to protect users’ data, restrict access to the device’s network to just the consumer, and more.<\/p>\n<p>The cybersecurity safety label announcement comes on the heels of the Federal Trade Commission and the Department of Justice jointly fining Amazon $25 million in May 2023 for privacy violations related to data gathered by its Alexa voice assistants and Ring cameras. <\/p>\n<h2><strong>What the future holds for IoT advertising <\/strong><\/h2>\n<p>In 2023, US adults spent more than 7.5 hours on connected devices each day, up an hour from 2020, per our forecast. With mobile and CTV making up more than three-quarters of US digital time spent, advertisers can also reach consumers through their connected devices.  <\/p>\n<p>As additional connected devices enter the market, advertising opportunities will follow, especially as these devices use real-time data, allowing for personalized messages. Advertising opportunities include CTV ads, mobile video, search via voice assistants, and digital audio ads in connected car systems. CTV ad spend, for example, has taken off. We forecast CTV ad spend to grow by double digits every year between 2024 and 2027, for a total of $40.90 billion.  <\/p>\n<div class=\"wp-block-image em-insights-image\">\n<figure class=\"aligncenter size-full\"><a rel=\"nofollow noopener\" target=\"_blank\" href=\"https:\/\/www.emarketer.com\/chart\/262315\/us-connected-tv-ctv-ad-spending-2021-2027-billions-change-of-digital-ad-spending\"><figcaption><em>A chart showing US CTV ad spend, 2021 to 2027.  <\/em><\/figcaption><\/figure>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Gone are the days when only computers, phones, and tablets connected to the internet. By 2025, EMARKETER forecasts that the average time spent with internet of things (IoT) devices like smart speakers and connected cars will reach 45 minutes per day. But for connected TVs (CTV), perhaps the connected devices that are becoming most ubiquitous [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":234,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Applications, Examples, Security &amp; Future of Ads - SESZP<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Applications, Examples, Security &amp; Future of Ads - SESZP\" \/>\n<meta property=\"og:description\" content=\"Gone are the days when only computers, phones, and tablets connected to the internet. By 2025, EMARKETER forecasts that the average time spent with internet of things (IoT) devices like smart speakers and connected cars will reach 45 minutes per day. But for connected TVs (CTV), perhaps the connected devices that are becoming most ubiquitous [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/\" \/>\n<meta property=\"og:site_name\" content=\"SESZP\" \/>\n<meta property=\"article:published_time\" content=\"2024-04-05T12:19:54+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-05-06T21:40:30+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/Applications-Examples-Security-Future-of-Ads.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1280\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"s4hes\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"s4hes\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/\"},\"author\":{\"name\":\"s4hes\",\"@id\":\"https:\/\/seszp.com\/#\/schema\/person\/5f779a8dbbb299996b9bf7d990b78093\"},\"headline\":\"Applications, Examples, Security &#038; Future of Ads\",\"datePublished\":\"2024-04-05T12:19:54+00:00\",\"dateModified\":\"2024-05-06T21:40:30+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/\"},\"wordCount\":1699,\"publisher\":{\"@id\":\"https:\/\/seszp.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/Applications-Examples-Security-Future-of-Ads.png\",\"articleSection\":[\"News\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/\",\"url\":\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/\",\"name\":\"Applications, Examples, Security & Future of Ads - SESZP\",\"isPartOf\":{\"@id\":\"https:\/\/seszp.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/Applications-Examples-Security-Future-of-Ads.png\",\"datePublished\":\"2024-04-05T12:19:54+00:00\",\"dateModified\":\"2024-05-06T21:40:30+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#primaryimage\",\"url\":\"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/Applications-Examples-Security-Future-of-Ads.png\",\"contentUrl\":\"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/Applications-Examples-Security-Future-of-Ads.png\",\"width\":1280,\"height\":720},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/seszp.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Applications, Examples, Security &#038; Future of Ads\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/seszp.com\/#website\",\"url\":\"https:\/\/seszp.com\/\",\"name\":\"SESZP\",\"description\":\"TECHNOLOGY\",\"publisher\":{\"@id\":\"https:\/\/seszp.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/seszp.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/seszp.com\/#organization\",\"name\":\"SESZP\",\"url\":\"https:\/\/seszp.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/seszp.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/seszp.png\",\"contentUrl\":\"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/seszp.png\",\"width\":448,\"height\":166,\"caption\":\"SESZP\"},\"image\":{\"@id\":\"https:\/\/seszp.com\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/seszp.com\/#\/schema\/person\/5f779a8dbbb299996b9bf7d990b78093\",\"name\":\"s4hes\",\"sameAs\":[\"https:\/\/seszp.com\"],\"url\":\"https:\/\/seszp.com\/author\/s4hes\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Applications, Examples, Security & Future of Ads - SESZP","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/","og_locale":"en_US","og_type":"article","og_title":"Applications, Examples, Security & Future of Ads - SESZP","og_description":"Gone are the days when only computers, phones, and tablets connected to the internet. By 2025, EMARKETER forecasts that the average time spent with internet of things (IoT) devices like smart speakers and connected cars will reach 45 minutes per day. But for connected TVs (CTV), perhaps the connected devices that are becoming most ubiquitous [&hellip;]","og_url":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/","og_site_name":"SESZP","article_published_time":"2024-04-05T12:19:54+00:00","article_modified_time":"2024-05-06T21:40:30+00:00","og_image":[{"width":1280,"height":720,"url":"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/Applications-Examples-Security-Future-of-Ads.png","type":"image\/png"}],"author":"s4hes","twitter_card":"summary_large_image","twitter_misc":{"Written by":"s4hes","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#article","isPartOf":{"@id":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/"},"author":{"name":"s4hes","@id":"https:\/\/seszp.com\/#\/schema\/person\/5f779a8dbbb299996b9bf7d990b78093"},"headline":"Applications, Examples, Security &#038; Future of Ads","datePublished":"2024-04-05T12:19:54+00:00","dateModified":"2024-05-06T21:40:30+00:00","mainEntityOfPage":{"@id":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/"},"wordCount":1699,"publisher":{"@id":"https:\/\/seszp.com\/#organization"},"image":{"@id":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#primaryimage"},"thumbnailUrl":"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/Applications-Examples-Security-Future-of-Ads.png","articleSection":["News"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/","url":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/","name":"Applications, Examples, Security & Future of Ads - SESZP","isPartOf":{"@id":"https:\/\/seszp.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#primaryimage"},"image":{"@id":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#primaryimage"},"thumbnailUrl":"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/Applications-Examples-Security-Future-of-Ads.png","datePublished":"2024-04-05T12:19:54+00:00","dateModified":"2024-05-06T21:40:30+00:00","breadcrumb":{"@id":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/seszp.com\/applications-examples-security-future-of-ads\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#primaryimage","url":"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/Applications-Examples-Security-Future-of-Ads.png","contentUrl":"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/Applications-Examples-Security-Future-of-Ads.png","width":1280,"height":720},{"@type":"BreadcrumbList","@id":"https:\/\/seszp.com\/applications-examples-security-future-of-ads\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/seszp.com\/"},{"@type":"ListItem","position":2,"name":"Applications, Examples, Security &#038; Future of Ads"}]},{"@type":"WebSite","@id":"https:\/\/seszp.com\/#website","url":"https:\/\/seszp.com\/","name":"SESZP","description":"TECHNOLOGY","publisher":{"@id":"https:\/\/seszp.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/seszp.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/seszp.com\/#organization","name":"SESZP","url":"https:\/\/seszp.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/seszp.com\/#\/schema\/logo\/image\/","url":"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/seszp.png","contentUrl":"https:\/\/seszp.com\/wp-content\/uploads\/2024\/04\/seszp.png","width":448,"height":166,"caption":"SESZP"},"image":{"@id":"https:\/\/seszp.com\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/seszp.com\/#\/schema\/person\/5f779a8dbbb299996b9bf7d990b78093","name":"s4hes","sameAs":["https:\/\/seszp.com"],"url":"https:\/\/seszp.com\/author\/s4hes\/"}]}},"_links":{"self":[{"href":"https:\/\/seszp.com\/wp-json\/wp\/v2\/posts\/233"}],"collection":[{"href":"https:\/\/seszp.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/seszp.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/seszp.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/seszp.com\/wp-json\/wp\/v2\/comments?post=233"}],"version-history":[{"count":1,"href":"https:\/\/seszp.com\/wp-json\/wp\/v2\/posts\/233\/revisions"}],"predecessor-version":[{"id":472,"href":"https:\/\/seszp.com\/wp-json\/wp\/v2\/posts\/233\/revisions\/472"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/seszp.com\/wp-json\/wp\/v2\/media\/234"}],"wp:attachment":[{"href":"https:\/\/seszp.com\/wp-json\/wp\/v2\/media?parent=233"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/seszp.com\/wp-json\/wp\/v2\/categories?post=233"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/seszp.com\/wp-json\/wp\/v2\/tags?post=233"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}